$loc$-$iloc$

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

In [2]:
import pandas as pd
file_name="C:\\Users\\Durga prasan sarangi\\jupyter\\naresh it\\data science omkar sir\\Visadataset.csv"
visadataset=pd.read_csv(file_name)
visadataset

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [5]:
<dataframe>.iloc[rows,columns]
<dataframe>.iloc[start:end,start:end]

SyntaxError: invalid syntax (2959243883.py, line 1)

In [6]:
<dataframe>.iloc[1:6,0:3]

SyntaxError: invalid syntax (1699500632.py, line 1)

In [6]:
visadataset.iloc[1:6,0:3]

  case_id continent education_of_employee
1  EZYV02      Asia              Master's
2  EZYV03      Asia            Bachelor's
3  EZYV04      Asia            Bachelor's
4  EZYV05    Africa              Master's
5  EZYV06      Asia              Master's

In [7]:
visadataset.take([0,1,2],axis=1).take([1,2,3,4,5])

  case_id continent education_of_employee
1  EZYV02      Asia              Master's
2  EZYV03      Asia            Bachelor's
3  EZYV04      Asia            Bachelor's
4  EZYV05    Africa              Master's
5  EZYV06      Asia              Master's

In [8]:
visadataset.iloc[100:106,7:11]

    region_of_employment  prevailing_wage unit_of_wage full_time_position
100            Northeast         28243.79         Year                  Y
101              Midwest         43421.88         Year                  Y
102              Midwest         80253.78         Year                  Y
103                 West        115235.95         Year                  Y
104            Northeast         95200.86         Year                  N
105               Island         41613.52         Year                  Y

In [9]:
visadataset.iloc[[100,200,300]]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [10]:
visadataset.take([100,200,300])

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [11]:
visadataset.iloc[[100,200,300],:]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [12]:
#100 200 300 rows from 7 and 11 column
ind_row=[100,200,300]
ind_col=[7,11]
visadataset.iloc[ind_row,ind_col]

    region_of_employment case_status
100            Northeast   Certified
200                 West   Certified
300              Midwest   Certified

In [13]:
visadataset.iloc[[100,200,300],[7,11]]

    region_of_employment case_status
100            Northeast   Certified
200                 West   Certified
300              Midwest   Certified

In [14]:
#2200 row and 1700 row from previaling wage column
visadataset.iloc[[2200,1700],[8]]

      prevailing_wage
2200         22856.14
1700        177310.49

In [15]:
visadataset.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [16]:
# 100 200 300 rows from education of employee and number of employee and case status
visadataset.iloc[[100,200,300],[2,5,11]]

    education_of_employee  no_of_employees case_status
100              Master's             2227   Certified
200             Doctorate             3282   Certified
300              Master's             3268   Certified

In [17]:
# to avoid counting the columns we use loc
visadataset.loc[rows,columns]
# in this we can provide the column name

NameError: name 'rows' is not defined

In [18]:
visadataset.loc[[2200,1700],['prevailing_wage']]

      prevailing_wage
2200         22856.14
1700        177310.49

In [19]:
visadataset.loc[[100,200,300],['education_of_employee','no_of_employees','case_status']]

    education_of_employee  no_of_employees case_status
100              Master's             2227   Certified
200             Doctorate             3282   Certified
300              Master's             3268   Certified

In [20]:
l1=['Apple','Ball','Cat','Dog']
l1.index('Ball')

1

In [21]:
type(visadataset.columns)

pandas.core.indexes.base.Index

In [22]:
cols_list=list(visadataset.columns)
cols_list.index('prevailing_wage')

8

In [23]:
cols_list.index('prevailing_wage')

8

In [24]:
visadataset.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [26]:
# If i keep all together
# Q) get 2200,1700 row from prevaialing wage using iloc with out manula count

# iloc will take only numbers, loc will take direct column names\

visadataset.columns  # it is not list====> we need to convert into list
cols_list=list(visadataset.columns)   # type cast to list
wage_index=cols_list.index('prevailing_wage') # getting the index by using index method
visadataset.iloc[[2200,1700],[wage_index]]  # this is apply the iloc

      prevailing_wage
2200         22856.14
1700        177310.49

In [28]:
cols_list=list(visadataset.columns)
cols_list

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [29]:
cols_list.index('prevailing_wage')

8

In [31]:
visadataset.columns
cols_list=list(visadataset.columns)
wage_index=cols_list.index('prevailing_wage')
visadataset.iloc[[2200,1700],[wage_index]]

      prevailing_wage
2200         22856.14
1700        177310.49

In [34]:
visadataset.dtypes     # data type of each column

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [35]:
visadataset.head(2)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified

In [36]:
visadataset.columns
visadataset.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [37]:
type(visadataset.dtypes)

pandas.core.series.Series

In [38]:
dict(visadataset.dtypes)

{'case_id': dtype('O'),
 'continent': dtype('O'),
 'education_of_employee': dtype('O'),
 'has_job_experience': dtype('O'),
 'requires_job_training': dtype('O'),
 'no_of_employees': dtype('int64'),
 'yr_of_estab': dtype('int64'),
 'region_of_employment': dtype('O'),
 'prevailing_wage': dtype('float64'),
 'unit_of_wage': dtype('O'),
 'full_time_position': dtype('O'),
 'case_status': dtype('O')}

In [39]:
list(visadataset.dtypes)

[dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O'),
 dtype('O')]

In [40]:
tuple(visadataset.dtypes)

(dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O'),
 dtype('O'))

In [41]:
cols_dict=dict(visadataset.dtypes)
for key,value in cols_dict.items():
    print(key,'=========',value)

case_id ========= object
continent ========= object
education_of_employee ========= object
has_job_experience ========= object
requires_job_training ========= object
no_of_employees ========= int64
yr_of_estab ========= int64
region_of_employment ========= object
prevailing_wage ========= float64
unit_of_wage ========= object
full_time_position ========= object
case_status ========= object

In [42]:
cols_dict=dict(visadataset.dtypes)
cat_list,num_list=[],[]
for key,value in cols_dict.items():
    if value=='O':
        cat_list.append(key)
    else:
        num_list.append(key)
        
cat_list,num_list

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [43]:
cat_list=[key for key,value in cols_dict.items() if value=='O']
num_list=[key for key,value in cols_dict.items() if value!='O']

In [44]:
cat_list,num_list

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

$info$

In [46]:
visadataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

$isnull$

In [47]:
visadataset.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

In [48]:
visadataset.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [4]:
cols_dict=dict(visadataset.dtypes)

#=============================M-1====================================
cat_list,num_list=[],[]
for key,value in cols_dict.items():
    if value=='O':
        cat_list.append(key)
    else:
        num_list.append(key)
cat_list,num_list


#===============================M-2====================================
cat_list=[key for key,value in cols_dict.items() if value=='O']

num_list=[key for key,value in cols_dict.items() if value!='O']


#pandas
#dictionary
#for
#if
#list